<template>
  <section id="TermsOfUse">
    <h2 :class="{ whiteHedingTermsOfUseTheme: !isDarkTheme }">Пользовательское соглашение</h2>

    <p>Настоящее Пользовательское Соглашение (Далее Соглашение) 
      регулирует отношения между владельцем halfcoder.ru (далее HalfCoder или Администрация) 
      с одной стороны и пользователем сайта с другой.
      Сайт HalfCoder является средством массовой информации.</p>

    <p>Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br>
      Если Вы не согласны с условиями данного соглашения, не используйте сайт HalfCoder!</p>

    <p :class="{ whiteTermsOfUseTheme: !isDarkTheme }"><strong>Предмет соглашения</strong><br>
      Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>

    <ul type="none">
      <li>- Текстовой информации</li>
      <li>- Аудиоматериалов</li>
      <li>- Видеоматериалов</li>
      <li>- Фотоматериалов</li>
      <li>- Ссылок на материалы, размещенные на других сайтах</li>
    </ul>

    <p :class="{ whiteTermsOfUseTheme: !isDarkTheme }"><strong>Права и обязанности сторон</strong><br>
      Пользователь имеет право:</p>

    <ul type="none">
      <li>- Осуществлять поиск информации на сайте</li>
      <li>- Получать информацию на сайте</li>
      <li>- Создавать информацию для сайта</li>
      <li>- Распространять информацию на сайте</li>
      <li>- Изменять рейтинг пользователей</li>
      <li>- Копировать информацию на другие сайты с указанием источника</li>
      <li>- Копировать информацию на другие сайты с разрешения Администрации сайта</li>
      <li>- Использовать информацию сайта в личных некоммерческих целях</li>
      <li>- Использовать информацию сайта в коммерческих целях с разрешения Администрации</li>
    </ul>

    <p>Администрация имеет право:</p>

    <ul type="none">
      <li>- По своему усмотрению и необходимости создавать, изменять, отменять правила</li>
      <li>- Ограничивать доступ к любой информации на сайте</li>
      <li>- Создавать, изменять, удалять информацию</li>
      <li>- Удалять учетные записи</li>
      <li>- Отказывать в регистрации без объяснения причин</li>
    </ul>

    <p>Пользователь обязуется:</p>

    <ul type="none">
      <li>- Обеспечить достоверность предоставляемой информации</li>
      <li>- обеспечивать сохранность личных данных от доступа третьих лиц</li>
      <li>- Не копировать информацию с других источников</li>
      <li>- При копировании информации с других источников, включать в её состав информацию об авторе</li>
      <li>- Не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</li>
      <li>- Не нарушать работоспособность сайта</li>
      <li>- Не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</li>
      <li>- Не совершать действия, направленные на введение других Пользователей в заблуждение</li>
      <li>- Не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
      <li>- Не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</li>
      <li>- Не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
      <li>- Не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
    </ul>

    <p>Администрация обязуется:</p>

    <ul type="none">
      <li>- Поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
      <li>- Осуществлять разностороннюю защиту учетной записи Пользователя</li>
      <li>- Защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
      <li>- Предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
    </ul>

    <p :class="{ whiteTermsOfUseTheme: !isDarkTheme }"><strong>Ответственность сторон</strong></p>

    <ul type="none">
      <li>- Пользователь лично несет полную ответственность за распространяемую им информацию</li>
      <li>- Администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</li>
      <li>- Администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</li>
      <li>- Администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
      <li>- В случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
    </ul>

    <p :class="{ whiteTermsOfUseTheme: !isDarkTheme }"><strong>Условия действия Соглашения</strong><br>
      Данное Соглашение вступает в силу при любом использовании данного сайта.<br>
      Соглашение перестает действовать при появлении его новой версии.<br>
      Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br>
      При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.
    </p>
    
    <p :class="{ whiteTermsOfUseTheme: !isDarkTheme }"><strong>Соглашение разработано на базе юридических документов сервиса Правилль</strong></p>
  </section>
</template>

<script lang="ts">
  import { defineComponent } from 'vue';
  import { ref, watch } from 'vue';
  import { useMainStore } from '@/stores/main';

  export default defineComponent({
    name: 'TermsOfUsePage',
    setup() {
      const store = useMainStore();
      const isDarkTheme = ref(store.isDarkTheme);

      watch(() => store.isDarkTheme, () => {
        isDarkTheme.value = store.isDarkTheme;
      });

      return {
        store,
        isDarkTheme
      }
    }
  })
</script>

<style lang="scss" scoped>
  @import '@/styles/variables';

  #TermsOfUse {
    display: grid;
    justify-content: start;
    grid-template-columns: 100%;
    padding: 2.5% 20%;
    width: 60%;
    h2 {
      width: 100%;
      height: 50px;
      color: #ffffff;
      font-family: 'Space Grotesk', sans-serif;
      text-align: center;
    }
    .whiteHedingTermsOfUseTheme {
      color: #1e1e1e;
    }
    p {
      margin-top: 30px;
      width: 100%;
      color: #747474;
      font-size: 18px;
      font-family: 'Space Grotesk', sans-serif;
      text-align: left;
      strong {
        color: #ffffff;
      }
    }
    p:nth-child(2) {
      margin-top: 0;
    }
    .whiteTermsOfUseTheme {
      strong {
        color: #1e1e1e; 
      }
    }
    ul {
      margin-top: 10px;
      margin-left: 2.5%;
      color: #747474;
      font-size: 18px;
      font-family: 'Space Grotesk', sans-serif;
      li {
        margin-top: 7.5px;
      }
      li:first-child {
        margin-top: 0;
      }
    }
  }
</style>